###############################################
                                              #
input1 = int(input("자연수 입력 : ")) + 1        #
sum1 = 0                                      #
                                              #
for i in range(1,input1):                     #
    sum1 += i                                 #
                                              #
print(f'1부터 {input1}까지의 합은 {sum1}')        #
                                              #
###############################################
                                              #
input2 = int(input("자연수 입력 : ")) + 1        #
sum2 = 1                                      #
                                              #
for i in range(1,input1):                     #
    sum2 *= i                                 #
                                              #
print(f'{input2}!은 {sum2}')                   #
                                              #
###############################################